package com.cczu.designpattern.behavior.command.service;

/**
 * 博客:https://bugstack.cn - 沉淀、分享、成⻓长，让⾃自⼰己和他⼈人都能有所收获!
 * 公众号:bugstack⾍虫洞洞栈
 * Create by ⼩小傅哥(fustack) @2020 *
 * 菜系
 * 01、⼭山东(鲁菜)——宫廷最⼤大菜系，以孔府⻛风味为⻰龙头。
 * 02、四川(川菜)——中国最有特⾊色的菜系，也是⺠民间最⼤大菜系。
 * 03、江苏(苏菜)——宫廷第⼆二⼤大菜系，古今国宴上最受⼈人欢迎的菜系。
 * 04、⼴广东(粤菜)——国内⺠民间第⼆二⼤大菜系，国外最有影响⼒力力的中国菜系，可以代表中国。
 * 05、福建(闽菜)——客家菜的代表菜系。
 * 06、浙江(浙菜)——中国最古⽼老老的菜系之⼀一，宫廷第三⼤大菜系。
 * 07、湖南(湘菜)——⺠民间第三⼤大菜系。
 * 08、安徽(徽菜)——徽州⽂文化的典型代表。
 * @author yjz
 */
public interface ICuisine {
    void cook(); // 烹调、制作
}
